case16_probes/cube_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include    "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #include    "include/initialConditions"

    inletOutlet
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           uniform $flowVelocity;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    Buildings
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
