case16_probes/cube_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include    "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #include    "include/initialConditions"

    inletOutlet
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
        supersonic      0;
        value           uniform $pressure;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    Buildings
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
