case16_probes/cube_case/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U);
probeLocations
(
    (30 0 2.5)
    (25.98 15 2.5)
    (0 30 2.5)
    (-25.98 15 2.5)
    (-30 0 2.5)
    (-25.98 -15 2.5)
    (0 -30 2.5)
    (25.98 -15 2.5)
    (60 0 2.5)
    (51.96 30 2.5)
    (0 60 2.5)
    (-51.96 30 2.5)
    (-60 0 2.5)
    (-51.96 -30 2.5)
    (0 -60 2.5)
    (51.96 -30 2.5)
    (90 0 2.5)
    (77.94 45 2.5)
    (0 90 2.5)
    (-77.94 45 2.5)
    (-90 0 2.5)
    (-77.94 -45 2.5)
    (0 -90 2.5)
    (77.94 -45 2.5)
);

// ************************************************************************* //
